TECHNICAL.org
#+TITLE: Internals and literate programming setup
#+LANGUAGE: en

This file documents the internals of daggerlib: the literate
programming setup, tangling pipeline, and editor configuration. See
[[file:readme.org][readme.org]] for an introduction.

* Module entry point
  :PROPERTIES:
  :ID:       48120ecb-7e3c-4cdb-8856-8304b784e40e
  :END:

  The =__init__.py= simply re-exports the =Lib= class:

  #+begin_src python :tangle src/lib/__init__.py
  """Reusable container helpers: base images, timezone, user setup, DinD, etc."""

  from .main import Lib as Lib
  #+end_src

  The =main.py= defines the =@object_type= class that composes all the
  functions defined in the use-case org files. Besides image versions,
  the class carries a =default_username= field so the container user
  is defined once and overridable globally — individual functions
  default to =None= and fall back to =self.default_username=. The
  =timezone= field (default =Europe/Paris=) controls which timezone is
  set in all container variants.

  #+begin_src python :tangle src/lib/main.py
  """Reusable container helpers: base images, timezone, user setup, DinD, etc."""

  from dagger import function, object_type

  from .dev import Dev
  from .alpine import (
      alpine,
      alpine_python,
      alpine_python_user_venv,
      alpine_set_tz,
      alpine_tz,
      alpine_user,
  )
  from .debian import (
      debian,
      debian_apt_cleanup,
      debian_localtime,
      debian_no_auto_install,
      debian_python_user_venv,
      debian_set_tz,
      debian_user,
  )
  from .python import python_user_venv, python_venv
  from .dind import dind_container, dind_with_docker
  from .distroless import distroless_debian, distroless_python3_debian, distroless_set_tz
  from .flask_venv import flask_venv
  from .pip_tools import pip_tools
  from .ralph import ralph
  from .user import as_user, setup_user, use_user


  @object_type
  class Lib:
      alpine_version: str = "3.23"
      debian_version: str = "13"
      debian_min_version: str = "2"
      pip_tools_python_version: str = "3.12"
      default_username: str = "sam"
      timezone: str = "Europe/Paris"
      dev_debian_image: str = "debian:bookworm-slim"
      dind_ubuntu_image: str = "ubuntu:24.04"

      # Alpine
      alpine_set_tz = alpine_set_tz
      alpine = alpine
      alpine_user = alpine_user
      alpine_tz = alpine_tz
      alpine_python = alpine_python
      alpine_python_user_venv = alpine_python_user_venv

      # Debian
      @property
      def debian_tag(self) -> str:
          return f"{self.debian_version}.{self.debian_min_version}-slim"

      debian_no_auto_install = debian_no_auto_install
      debian_set_tz = debian_set_tz
      debian_apt_cleanup = debian_apt_cleanup
      debian = debian
      debian_user = debian_user
      debian_python_user_venv = debian_python_user_venv
      debian_localtime = debian_localtime

      # Python
      python_venv = python_venv
      python_user_venv = python_user_venv

      # Distroless
      distroless_set_tz = distroless_set_tz
      distroless_python3_debian = distroless_python3_debian
      distroless_debian = distroless_debian

      # User
      setup_user = setup_user
      as_user = as_user
      use_user = use_user


      # Pip tools
      pip_tools = pip_tools

      # Flask
      flask_venv = flask_venv

      # DinD
      dind_container = dind_container
      dind_with_docker = dind_with_docker

      # Ralph
      ralph = ralph

      @function
      def dev(self) -> Dev:
          """Development tooling: tangle, test, and run inside containers."""
          return Dev(debian_image=self.dev_debian_image)
  #+end_src

* Editor configuration
  :PROPERTIES:
  :ID:       d36cf7bf-faac-46a9-9150-4031c8f06ca6
  :END:

  The =.dir-locals.el= ensures that Emacs preserves Python indentation
  inside org code blocks. Without this, =C-c '= (org-edit-special) would
  re-indent Python code relative to the org heading level.

  #+begin_src emacs-lisp :tangle .dir-locals.el
    ((org-mode
      . ((org-babel-default-header-args:python
          . ((:preserve-indentation . t)))
         (org-id-link-to-org-use-id . nil)
         (eval . (load (expand-file-name "reproducibility-helpers.el"
                         (locate-dominating-file default-directory ".dir-locals.el"))
                       t)))))
  #+end_src

* Development

  The org files are the source of truth. The Python modules, test scripts,
  and =tangle.sh= itself are all generated. To regenerate everything from
  scratch:

  #+begin_src bash
  rm -rf src/lib/alpine.py src/lib/debian.py src/lib/dind.py \
         src/lib/distroless.py src/lib/flask_venv.py src/lib/pip_tools.py \
         src/lib/user.py src/lib/main.py src/lib/__init__.py \
         tests/*.sh tests/test_use_cases.py \
         tangle.sh tangle.el test.sh
  dagger develop
  ./tangle.sh
  #+end_src

* Source directory convention

  Some functions need files from the module source tree (shell scripts,
  config files). There are two patterns depending on context.

** =dag.address(".")= for Lib functions (tested via the harness)

   =DefaultPath(".")= is resolved by the Dagger CLI, but the Python
   test harness calls functions directly — =DefaultPath= never fires.
   For functions that must work in both contexts, use an explicit
   =src: dagger.Directory | None = None= parameter with a fallback
   to =dag.address(".").directory()=:

   #+begin_src python :tangle no
   def my_function(
       self,
       src: dagger.Directory | None = None,
   ) -> dagger.Container:
       if src is None:
           src = dag.address(".").directory()
       return (
           dag.container().from_("...")
           .with_file("/tmp/script.sh", src.file("src/lib/script.sh"))
           .with_exec(["sh", "/tmp/script.sh"])
       )
   #+end_src

   This works everywhere:
   - =dagger call= (CLI resolves "." to the module context)
   - Python test harness (pytest resolves "." to the working directory)
   - Direct SDK usage (caller can pass any directory)

   The shell scripts themselves live in tangled =.sh= files under
   =src/lib/=, keeping shell code in shell and Python code in Python.

** =DefaultPath(".")= for Dev functions (CLI-only)

   [[file:src/dev.org][Dev]] functions (=tangle=, =run=, =test=) keep using
   =DefaultPath(".")=. They are the exception because:

   1. They mount the *entire project root* as a working directory
      (scripts, =sdk/=, org files, etc.), not just a file or two.
   2. =dag.address(".")= inside a module does not resolve to the
      CLI-provided context directory — it resolves to wherever the
      engine is running, which lacks project files.
   3. =dag.current_module().source()= returns the module's source
      subdirectory, not the project root.
   4. They are only ever called via =dagger call= (never from the
      Python test harness), so =DefaultPath= always fires.

* Reproducibility helpers

  Helpers loaded both by =tangle.el= (batch) and =.dir-locals.el=
  (interactive), so tangling works the same way everywhere.

  Those MUST be kept as minimal as possible, to avoid drifting too far from
  vanilla.

  The ruff post-tangle hook ensures that Python files are formatted
  identically whether tangled from the command line or interactively.

  The =fixtureyaml= org-babel language generates drawer content from
  YAML specs: CLI bash blocks, tangle blocks for =tests/expected/=,
  and (for userfunction specs) Python =@function= methods. It never
  executes the CLI — results are computed later by =run.sh=, which
  evaluates the bash blocks and populates =#+RESULTS:= in the org
  files. Tangling then writes those results to =tests/expected/=
  via noweb references.

  The YAML spec is the single source of truth for both the displayed
  CLI command (generated by =tests/generate_tests.py=) and the SDK
  test (executed by =tests/test_sdk.py=). The SDK exercises the same
  functions with the same arguments as =dagger call=, so a passing
  SDK test guarantees the displayed command works.


  #+begin_src emacs-lisp :tangle reproducibility-helpers.el
  ;;; reproducibility-helpers.el --- Post-tangle hooks and fixtureyaml language

  (defun fixtureyaml--call-generator (yaml-body root)
    "Call generate_tests.py with YAML-BODY, return output.
  Also writes the spec file when a name is present."
    (let ((script (expand-file-name "tests/generate_tests.py" root)))
      (string-trim
       (shell-command-to-string
        (format "echo %s | python3 %s %s"
                (shell-quote-argument yaml-body)
                (shell-quote-argument script)
                (shell-quote-argument root))))))

  (defun org-babel-execute:fixtureyaml (body params)
    "Generate drawer content from a fixtureyaml block (no execution)."
    (let* ((info (org-babel-get-src-block-info t))
           (name (nth 4 info))
           (root (expand-file-name
                  (locate-dominating-file default-directory ".git")))
           (augmented (concat body "\nname: " name "\n")))
      (fixtureyaml--call-generator augmented root)))

  ;; :cache yes skips execution when the block hasn't changed.
  ;; :results drawer wraps the output so org can replace it cleanly.
  ;; :exports results shows only the CLI + result on export, hiding the YAML.
  (setq org-babel-default-header-args:fixtureyaml
        '((:cache . "yes")
          (:results . "drawer")
          (:exports . "results")))

  ;;; reproducibility-helpers.el ends here
  #+end_src

* Org-mode pin

  Both =tangle-nodagger.sh= (bash) and =Dev.container()= (Python)
  clone a pinned org-mode commit. The pin lives in a single file so
  it cannot diverge. The bash side inlines the hash at tangle time
  via noweb; the Python side reads =.org-pin= at runtime.

  #+NAME: org-pin
  #+begin_src conf :tangle .org-pin :comments no :padline no
  1025e3b49a98f175b124dbccd774918360fe7e11
  #+end_src

  The =ensure-org= block checks that the cloned org-mode matches
  the pin and re-clones if needed. Both =-nodagger= scripts
  reference it via noweb.

  #+NAME: ensure-org
  #+begin_src bash :tangle no :noweb yes
  # Ensure pinned org-mode is cloned and up-to-date
  ORG_PIN="<<org-pin>>"
  ORG_DIR="$SCRIPT_DIR/.tangle-deps/org"
  if [ -d "$ORG_DIR" ] && [ "$(git -C "$ORG_DIR" rev-parse HEAD 2>/dev/null)" != "$ORG_PIN" ]; then
      echo "Org-mode pin changed, re-cloning..."
      rm -rf "$ORG_DIR"
  fi
  if [ ! -d "$ORG_DIR" ]; then
      echo "Cloning pinned org-mode ($ORG_PIN)..."
      mkdir -p "$SCRIPT_DIR/.tangle-deps"
      git clone --quiet https://git.savannah.gnu.org/git/emacs/org-mode.git "$ORG_DIR"
      git -C "$ORG_DIR" checkout --quiet "$ORG_PIN"
      # Generate org-loaddefs.el and org-version.el (needed for org to load properly)
      emacs --batch --no-init-file \
          --eval "(progn
                    (push \"$ORG_DIR/lisp\" load-path)
                    (require 'autoload)
                    (setq generated-autoload-file \"$ORG_DIR/lisp/org-loaddefs.el\")
                    (update-directory-autoloads \"$ORG_DIR/lisp\"))" 2>/dev/null
      ORG_GIT_VERSION=$(git -C "$ORG_DIR" describe --tags --match "release_*" 2>/dev/null || echo "N/A")
      ORG_RELEASE=$(echo "$ORG_GIT_VERSION" | sed 's/^release_//;s/-.*//')
      (cd "$ORG_DIR/lisp" && emacs --batch --no-init-file \
          --eval "(progn
                    (push \"$ORG_DIR/lisp\" load-path)
                    (load \"$ORG_DIR/mk/org-fixup.el\")
                    (org-make-org-version \"$ORG_RELEASE\"
                                          \"$ORG_GIT_VERSION\"))") 2>/dev/null || true
  fi
  #+end_src

* Tangle configuration
  :PROPERTIES:
  :ID:       0474ada9-a621-4c1a-97aa-270cf96e32c4
  :END:

  When =tangle.sh= runs Emacs in batch mode, it loads =tangle.el= to
  configure org-babel before tangling. This ensures that tangled files
  get link comments pointing back to their source block (=:comments yes=)
  and blank lines between blocks (=:padline yes=). It also loads a pinned
  org-mode version from =.tangle-deps/= for reproducibility and registers
  the bash and python babel languages.

  Batch Emacs cannot interact with the user. If org-babel encounters an
  unknown language with =:comments yes=, it tries to ask for the comment
  syntax and silently fails. We guard against this by making any
  interactive prompt a hard error in batch mode, so the problem surfaces
  immediately instead of producing a silent partial tangle.

  Since batch Emacs has no user init, packages like =nix-mode= are not
  available. We map the =nix= language to =conf-mode= so that org-babel
  recognises =#+begin_src nix= blocks for tangling without requiring an
  extra package.

  #+begin_src emacs-lisp :tangle tangle.el
  ;;; tangle.el --- Self-contained org-babel tangling for dagger lib -*- lexical-binding: t; -*-

  ;; Don't prompt for code block evaluation
  (setq org-confirm-babel-evaluate nil)

  ;; In batch mode, any interactive prompt means something is misconfigured
  ;; (e.g. unknown language with :comments yes).  Fail loudly instead of
  ;; hanging or silently skipping blocks.
  (when noninteractive
    (dolist (fn '(read-string read-from-minibuffer completing-read))
      (advice-add fn :before
                  (lambda (&rest _)
                    (error "Tangle aborted: batch Emacs cannot interact (check language modes in tangle.el)")))))

  ;; Load pinned org-mode from .tangle-deps BEFORE anything else loads the
  ;; built-in org.  This must happen before (require 'ob-shell) since that
  ;; transitively loads org.
  (let ((org-lisp-dir
         (expand-file-name ".tangle-deps/org/lisp"
                           (file-name-directory (or load-file-name buffer-file-name)))))
    (when (file-directory-p org-lisp-dir)
      (push org-lisp-dir load-path)
      (let ((contrib (expand-file-name "../contrib/lisp" org-lisp-dir)))
        (when (file-directory-p contrib)
          (push contrib load-path)))
      ;; Force load of pinned org (unload built-in if already loaded)
      (require 'org)))

  ;; Load babel languages needed for tangling
  (require 'ob-shell)
  (require 'ob-python)

  ;; Map nix to conf-mode so #+begin_src nix blocks tangle without nix-mode
  (add-to-list 'org-src-lang-modes '("nix" . conf))

  ;; Add link comments and blank lines between blocks in tangled output
  (setq org-babel-default-header-args
        (cons '(:comments . "yes")
              (cons '(:padline . "yes")
                    (assq-delete-all :comments
                      (assq-delete-all :padline
                        org-babel-default-header-args)))))

  ;; Preserve indentation in Python blocks so that org-level indentation
  ;; does not interfere with Python's significant whitespace.
  (add-to-list 'org-babel-default-header-args:python
               '(:preserve-indentation . t))

  ;; Load reproducibility helpers (shared with interactive Emacs
  ;; via .dir-locals.el).
  (load (expand-file-name "reproducibility-helpers.el"
           (file-name-directory (or load-file-name buffer-file-name)))
        t)

  ;;; tangle.el ends here
  #+end_src

* Tangle without dagger (bootstrap)
  :PROPERTIES:
  :ID:       0474c6e4-ce96-4f94-8254-1824581b9f8f
  :END:

  This script tangles the minimum files needed for mode 2 (dagger) to
  work. It uses host tools (emacs, git, ruff) and solves the
  chicken-and-egg problem: dagger functions are tangled Python, so you
  need this script to generate them the first time.

  When called with arguments, it tangles the specified files instead.

  #+begin_src bash :tangle tangle-nodagger.sh :shebang "#!/usr/bin/env bash" :noweb yes
  # Bootstrap tangle using host tools (emacs, git, ruff).
  # Usage:
  #   ./tangle-nodagger.sh                 # tangle only mode 2 bootstrap files
  #   ./tangle-nodagger.sh src/foo.org     # tangle a specific file
  set -euo pipefail

  SCRIPT_DIR="$(cd "$(dirname "$0")" && pwd)"

  <<ensure-org>>

  tangle_file() {
      local orgfile="$1"
      echo "Tangling $orgfile..."
      local raw_output tangled_list rc=0
      raw_output=$(emacs --batch --no-init-file \
          -l "$SCRIPT_DIR/tangle.el" \
          --eval "(progn
                    (require 'org)
                    (find-file \"$orgfile\")
                    (let ((files (org-babel-tangle)))
                      (dolist (f files) (princ (format \"%s\n\" f))))
                    (kill-buffer))" 2>&1) || rc=$?
      if [ "$rc" -ne 0 ]; then
          echo "ERROR: emacs tangle failed (exit $rc):" >&2
          echo "$raw_output" >&2
          return "$rc"
      fi
      tangled_list=$(echo "$raw_output" | grep -E '^/' || true)
      # Post-process tangled files
      for f in $tangled_list; do
          [ -f "$f" ] || continue
          # Strip trailing whitespace
          sed -i 's/[[:space:]]*$//' "$f"
          # Format Python files
          case "$f" in
              *.py) ruff format --quiet "$f" 2>/dev/null || true ;;
          esac
      done
  }

  if [ $# -eq 0 ]; then
      # Bootstrap only: tangle the files that produce mode 2 infrastructure
      for f in "$SCRIPT_DIR"/TECHNICAL.org "$SCRIPT_DIR"/src/dev.org "$SCRIPT_DIR"/tests/testing.org; do
          [ -f "$f" ] && tangle_file "$f"
      done
  else
      for f in "$@"; do
          tangle_file "$(realpath "$f")"
      done
  fi
  #+end_src

* Tangle script (mode 2)
  :PROPERTIES:
  :ID:       a7c3e1f4-5b2d-4d8e-9f6a-2c1b3e4d5f6a
  :END:

  The daily-use tangle script delegates to dagger. All org files are
  tangled inside the dev container for reproducibility.

  #+begin_src bash :tangle tangle.sh :shebang "#!/usr/bin/env bash"
    set -eu
    cd "$(dirname "$0")"
    exec dagger call --progress=plain dev tangle export --path=.
  #+end_src

* Run configuration
  :PROPERTIES:
  :ID:       0ee81e6f-f3c5-444a-9c36-ea8d777ede25
  :END:

  Like =tangle.el= configures tangling, =run.el= configures batch
  execution of org-babel blocks. It provides =dagger-run-file= to
  execute bash blocks (=dagger call= commands) and save the results.
  =dagger-run-ignore-cache= overrides =:cache= to ="no"= globally so
  that all blocks re-execute regardless of whether their content
  changed — useful when an external dependency changed but the block
  source didn't. Fixtureyaml blocks are handled separately by
  =yamldagger.sh=. The =dagger= wrapper in =tests/= handles
  suppressing TUI noise (see =testing.org=).

  #+begin_src emacs-lisp :tangle run.el
    ;;; run.el --- Batch-execute org-babel bash blocks -*- lexical-binding: t; -*-

    (defun dagger-run-ignore-cache ()
      "Override :cache to \"no\" so all blocks re-execute."
      (setq org-babel-default-header-args
            (cons '(:cache . "no")
                  (assq-delete-all :cache org-babel-default-header-args))))

    (defun dagger-run-file (orgfile)
      "Execute bash blocks in ORGFILE (fixtureyaml is handled by yamldagger.sh)."
      (find-file orgfile)
      (org-babel-map-src-blocks nil
        (when (string= lang "bash")
          (message "%s Executing %s %s..." (format-time-string "%H:%M:%S") lang
                   (or (org-element-property :name (org-element-at-point)) "(unnamed)"))
          (org-babel-execute-src-block)))
      (save-buffer)
      (kill-buffer))

    ;;; run.el ends here
  #+end_src

* Run without dagger
  :PROPERTIES:
  :ID:       a7f2c1d8-3e5b-4a9f-b6c2-8d4e1f0a5b3c
  :END:

  Like =tangle-nodagger.sh= runs tangle using host tools,
  =run-nodagger.sh= executes org-babel blocks using emacs in batch
  mode. =Dev.run()= calls this script inside the container — it must
  not delegate back to =dagger call= or it would recurse infinitely.

  #+begin_src bash :tangle run-nodagger.sh :shebang "#!/usr/bin/env bash" :noweb yes
    # Execute org-babel blocks and save results.
    # Usage:
    #   ./run-nodagger.sh                    # run all src and doc org files
    #   ./run-nodagger.sh --no-cache         # ignore cached results
    #   ./run-nodagger.sh src/foo.org        # run a specific file
    set -eu

    SCRIPT_DIR="$(cd "$(dirname "$0")" && pwd)"

    NO_CACHE=
    if [ "${1:-}" = "--no-cache" ]; then
        NO_CACHE=1
        shift
    fi

  <<ensure-org>>

    export PATH="$SCRIPT_DIR/tests:$PATH"

    run_file() {
        local orgfile="$1"
        echo "Running $orgfile..."
        local raw_output rc=0 no_cache_eval=""
        if [ -n "$NO_CACHE" ]; then
            no_cache_eval="(dagger-run-ignore-cache)"
        fi
        raw_output=$(emacs --batch --no-init-file \
            -l "$SCRIPT_DIR/tangle.el" \
            -l "$SCRIPT_DIR/run.el" \
            --eval "(progn $no_cache_eval (dagger-run-file \"$orgfile\"))" 2>&1) || rc=$?
        if [ "$rc" -ne 0 ]; then
            echo "ERROR: emacs run failed (exit $rc):" >&2
            echo "$raw_output" >&2
            return "$rc"
        fi
    }

    if [ $# -eq 0 ]; then
        for f in "$SCRIPT_DIR"/src/*.org "$SCRIPT_DIR"/examples/*/readme.org; do
            [ -f "$f" ] && run_file "$f"
        done
    else
        for f in "$@"; do
            test -f "$(realpath "$f")" # assert thanks to set -eu
            run_file "$(realpath "$f")"
        done
    fi
  #+end_src

* Run script (mode 2)
  :PROPERTIES:
  :ID:       b275b2e3-ea23-4ca8-b69a-f7dd4e11d56a
  :END:

  Executes all org-babel blocks inside the dev container and saves
  the results. Populates the =#+RESULTS:= blocks that tangling
  writes to =tests/expected/= via noweb references.

  #+begin_src bash :tangle run.sh :shebang "#!/usr/bin/env bash"
    set -eu
    cd "$(dirname "$0")"
    args=()
    if [ "${1:-}" = "--no-cache" ]; then
        args+=(--no-cache)
        shift
    fi
    exec dagger call --progress=plain dev run "--args=$*" export --path=.
  #+end_src
